## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 RESOURCE                                 |
|--------|--------------------------------------------------------------------------|
| add    | `aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths` |
| update | `aws_wafv2_web_acl.superset`                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "label_sizerestrictions_body_excluded_paths" {
      + arn         = (known after apply)
      + description = "Paths that should not be blocked by the SizeRestrictions_BODY rule"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "label_sizerestrictions_body_excluded_paths"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + regular_expression {
          + regex_string = "^/api/v1/(dashboard|chart|dataset).*$"
        }
      + regular_expression {
          + regex_string = "^/superset/explore_json/.*$"
        }
    }

  # aws_wafv2_web_acl.superset will be updated in-place
  ~ resource "aws_wafv2_web_acl" "superset" {
        id                          = "62d84f0f-a9ab-4c4b-8510-8e84e95edce2"
        name                        = "superset_lb"
        tags                        = {
            "CostCentre" = "cds-superset-staging"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - rule {
          - name     = "Label_SizeRestrictions_BODY" -> null
          - priority = 55 -> null

          - action {
              - block {
                }
            }

          - statement {
              - and_statement {
                  - statement {
                      - label_match_statement {
                          - key   = "awswaf:managed:aws:core-rule-set:SizeRestrictions_Body" -> null
                          - scope = "LABEL" -> null
                        }
                    }
                  - statement {
                      - not_statement {
                          - statement {
                              - and_statement {
                                  - statement {
                                      - byte_match_statement {
                                          - positional_constraint = "EXACTLY" -> null
                                          - search_string         = "put" -> null

                                          - field_to_match {
                                              - method {}
                                            }

                                          - text_transformation {
                                              - priority = 0 -> null
                                              - type     = "LOWERCASE" -> null
                                            }
                                        }
                                    }
                                  - statement {
                                      - byte_match_statement {
                                          - positional_constraint = "CONTAINS" -> null
                                          - search_string         = "/api/v1/dashboard" -> null

                                          - field_to_match {
                                              - uri_path {}
                                            }

                                          - text_transformation {
                                              - priority = 0 -> null
                                              - type     = "LOWERCASE" -> null
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "Label_SizeRestrictions_BODY" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 10 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 30 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesLinuxRuleSet" -> null
          - priority = 40 -> null

          - override_action {
              - none {}
            }

          - statement {
              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesLinuxRuleSet" -> null
                  - vendor_name = "AWS" -> null
                    # (1 unchanged attribute hidden)
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesLinuxRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "Label_SizeRestrictions_BODY"
          + priority = 55

          + action {
              + block {
                }
            }

          + statement {
              + and_statement {
                  + statement {
                      + label_match_statement {
                          + key   = "awswaf:managed:aws:core-rule-set:SizeRestrictions_Body"
                          + scope = "LABEL"
                        }
                    }
                  + statement {
                      + not_statement {
                          + statement {
                              + and_statement {
                                  + statement {
                                      + regex_match_statement {
                                          + regex_string = "^(put|post)$"

                                          + field_to_match {
                                              + method {}
                                            }

                                          + text_transformation {
                                              + priority = 0
                                              + type     = "LOWERCASE"
                                            }
                                        }
                                    }
                                  + statement {
                                      + regex_pattern_set_reference_statement {
                                          + arn = (known after apply)

                                          + field_to_match {
                                              + uri_path {}
                                            }

                                          + text_transformation {
                                              + priority = 0
                                              + type     = "LOWERCASE"
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "Label_SizeRestrictions_BODY"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 30

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 40

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.data_lake"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.superset_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.label_sizerestrictions_body_excluded_paths"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
